In [1]:
import pandas as pd
import numpy as np

ModuleNotFoundError: No module named 'pandas'

In [ ]:
# SERIES
s = pd.Series([1, 2, 3, 4, 5])

In [ ]:

# Create series from dictionary
s2 = pd.Series({'a': 1, 'b': 2, 'c': 3})

In [ ]:
# Create series with custom index
data=[10, 20, 30,]
index=['a', 'b', 'c']
s3=pd.Series(data, index=index)

In [ ]:
## DATAFRAME
# Create DataFrame from dictionary of lists
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 25, 26],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
np.array(df)

array([['Alice', 24, 'New York'],
       ['Bob', 25, 'Los Angeles'],
       ['Charlie', 26, 'Chicago']], dtype=object)

In [ ]:
# Create DataFrame from list of dictionaries
data2 = [
    {'Name': 'Alice', 'Age': 24, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 25, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 26, 'City': 'Chicago'}
]
df2 = pd.DataFrame(data2)
df["Name"]

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [ ]:
type(df["Name"])

pandas.core.series.Series

In [ ]:
df.loc[0]  # Access first row

Name       Alice
Age           24
City    New York
Name: 0, dtype: object

In [ ]:
df.loc[0][0]  # Access first element of first row

C:\R\ipykernel_17792\2080416439.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]  # Access first element of first row

'New York'

In [ ]:
df.iloc[0]  # Access first row using iloc

Name       Alice
Age           24
City    New York
Name: 0, dtype: object

In [ ]:
df.at[1, 'Name']  # Access 'Name' of second row

'Bob'

In [ ]:
##Accessing a specific element using at
df.iat[2, 0]

'Charlie'

In [ ]:
#### Data manipulation with DataFrame
# Add a new column
df['Salary'] = [70000, 80000, 90000]
df

      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   25  Los Angeles   80000
2  Charlie   26      Chicago   90000

In [ ]:
#Remove a column
df.drop('Salary', axis=1, inplace=True)

#axis=1 means column
#axis=0 means row
#inplace=True means modify the original DataFrame

In [ ]:
#Add age to column
df['Age'] += 1  # Increment age by 1
df

      Name  Age         City  Salary
0    Alice   26     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   28      Chicago   90000

In [ ]:
#remove rows
df.drop(0,inplace=True)
df

      Name  Age         City  Salary
1      Bob   27  Los Angeles   80000
2  Charlie   28      Chicago   90000